[
    { "ref": "Philippians 4:6-7", "text": "Do not be anxious about anything, but in every situation, by prayer and petition, with thanksgiving, present your requests to God. And the peace of God, which transcends all understanding, will guard your hearts and your minds in Christ Jesus." },
    { "ref": "John 3:16", "text": "For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life." },
    { "ref": "Proverbs 3:5-6", "text": "Trust in the LORD with all your heart and lean not on your own understanding; in all your ways submit to him, and he will make your paths straight." },
    { "ref": "Matthew 11:28-30", "text": "Come to me, all you who are weary and burdened, and I will give you rest. Take my yoke upon you and learn from me, for I am gentle and humble in heart, and you will find rest for your souls." },
    { "ref": "Romans 8:28", "text": "And we know that in all things God works for the good of those who love him, who have been called according to his purpose." },
    { "ref": "Jeremiah 29:11", "text": "For I know the plans I have for you, declares the LORD, plans to prosper you and not to harm you, plans to give you hope and a future." },
    { "ref": "Psalm 23:1-4", "text": "The LORD is my shepherd, I lack nothing. He makes me lie down in green pastures, he leads me beside quiet waters, he refreshes my soul. He guides me along the right paths for his name's sake. Even though I walk through the darkest valley, I will fear no evil, for you are with me; your rod and your staff, they comfort me." },
    { "ref": "Isaiah 41:10", "text": "So do not fear, for I am with you; do not be dismayed, for I am your God. I will strengthen you and help you; I will uphold you with my righteous right hand." },
    { "ref": "2 Timothy 1:7", "text": "For God has not given us a spirit of fear, but of power and of love and of a sound mind." },
    { "ref": "1 Peter 5:7", "text": "Cast all your anxiety on him because he cares for you." },
    { "ref": "Matthew 6:33-34", "text": "But seek first his kingdom and his righteousness, and all these things will be given to you as well. Therefore do not worry about tomorrow, for tomorrow will worry about itself." },
    { "ref": "Romans 12:2", "text": "Do not conform to the pattern of this world, but be transformed by the renewing of your mind. Then you will be able to test and approve what God's will is—his good, pleasing and perfect will." },
    { "ref": "Ephesians 2:8-9", "text": "For it is by grace you have been saved, through faith—and this is not from yourselves, it is the gift of God—not by works, so that no one can boast." },
    { "ref": "Joshua 1:9", "text": "Have I not commanded you? Be strong and courageous. Do not be afraid; do not be discouraged, for the LORD your God will be with you wherever you go." },
    { "ref": "Psalm 46:1", "text": "God is our refuge and strength, an ever-present help in trouble." },
    { "ref": "John 14:6", "text": "Jesus answered, 'I am the way and the truth and the life. No one comes to the Father except through me.'" },
    { "ref": "Romans 5:8", "text": "But God demonstrates his own love for us in this: While we were still sinners, Christ died for us." },
    { "ref": "1 Corinthians 10:13", "text": "No temptation has overtaken you except what is common to mankind. And God is faithful; he will not let you be tempted beyond what you can bear." },
    { "ref": "Hebrews 11:1", "text": "Now faith is confidence in what we hope for and assurance about what we do not see." },
    { "ref": "James 1:2-3", "text": "Consider it pure joy, my brothers and sisters, whenever you face trials of many kinds, because you know that the testing of your faith produces perseverance." }
]
